{"meta":{"title":"Amblizer's Mainframe","subtitle":null,"description":null,"author":"Amblizer","url":"http://amblizer.xyz"},"pages":[],"posts":[{"title":"SCOM - Push Agent","slug":"SCOM-push-agent","date":"2018-10-28T16:00:00.000Z","updated":"2018-10-29T16:31:32.688Z","comments":true,"path":"2018/10/28/SCOM-push-agent/","link":"","permalink":"http://amblizer.xyz/2018/10/28/SCOM-push-agent/","excerpt":"","text":"https://docs.microsoft.com/en-us/system-center/scom/manage-deploy-windows-agent-console?view=sc-om-1807","categories":[{"name":"Server","slug":"Server","permalink":"http://amblizer.xyz/categories/Server/"}],"tags":[{"name":"System Center","slug":"System-Center","permalink":"http://amblizer.xyz/tags/System-Center/"},{"name":"Operations Manager","slug":"Operations-Manager","permalink":"http://amblizer.xyz/tags/Operations-Manager/"},{"name":"SCOM","slug":"SCOM","permalink":"http://amblizer.xyz/tags/SCOM/"}]},{"title":"Upgrade SCOM from 2012 r2 UR14 to 2016","slug":"SCOM-upgrade","date":"2018-10-26T16:00:00.000Z","updated":"2018-10-29T16:31:42.399Z","comments":true,"path":"2018/10/26/SCOM-upgrade/","link":"","permalink":"http://amblizer.xyz/2018/10/26/SCOM-upgrade/","excerpt":"Pre-Upgrade Review the Operations Manager event logs, save a copy. Cleanup the ETL table, use scripts below on OM db.","text":"Pre-Upgrade Review the Operations Manager event logs, save a copy. Cleanup the ETL table, use scripts below on OM db. 123456789101112131415161718192021222324-- (c) Copyright 2004-2006 Microsoft Corporation, All Rights Reserved ---- Proprietary and confidential to Microsoft Corporation -- -- File: CatchupETLGrooming.sql ---- Contents: A bug in the ETL grooming code could have left the customer ---- Database with a large amount of ETL rows to groom. This script will groom ---- The ETL entries in a loop 100K rows at a time to avoid filling up the ---- Transaction log -----------------------------------------------------------------------------------DECLARE @RowCount int = 1;DECLARE @BatchSize int = 100000;DECLARE @SubscriptionWatermark bigint = 0; DECLARE @LastErr int;-- Delete rows from the EntityTransactionLog. We delete the rows with TransactionLogId that aren't being-- used anymore by the EntityChangeLog table and by the RelatedEntityChangeLog table.SELECT @SubscriptionWatermark = dbo.fn_GetEntityChangeLogGroomingWatermark();WHILE(@RowCount &gt; 0)BEGIN DELETE TOP(@BatchSize) ETL FROM EntityTransactionLog ETL WHERE NOT EXISTS (SELECT 1 FROM EntityChangeLog ECL WHERE ECL.EntityTransactionLogId = ETL.EntityTransactionLogId) AND NOT EXISTS (SELECT 1 FROM RelatedEntityChangeLog RECL WHERE RECL.EntityTransactionLogId = ETL.EntityTransactionLogId) AND ETL.EntityTransactionLogId &lt; @SubscriptionWatermark; SELECT @LastErr = @@ERROR, @RowCount = @@ROWCOUNT; END Remove Agents from pending management In the Administration pane, expand Device Management, and then click Pending Management. Right-click each agent, and then click Approve or Reject. Disable notification subscriptions Also in Administration view, expand Administration, expand the Notifications container, and then click Subscriptions. Select each subscription, and then click Disable in the Actions pane. (Do not try to multi select) Verify the OM database has more than 50 percent free Open SSMS, expand Databases and right-click the OperationsManager database, select to Reports, Standard Reports, and then click Disk Usage. View the Disk Usage report. If the database does not have 50 percent free, right-click the OperationsManager database, and then click Properties. Under Select a page, click Files. In the results pane, increase the Initial Size value for the MOM_DATA database by 50 percent. Backup the OM databases (If not backup regularly) Stop Operations Manager services Increase agent HealthService cache size Update the following registry setting on the agents: HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlsSet\\Services\\HealthService\\Parameters\\Management Groups&lt;ManagementGroupName&gt;\\maximumQueueSizeKb Default is 15360 (15 MB), change it to is 76800 (75 MB). Reset it back after upgrading. UpgradePost-Upgrade Re-enable the Notification Subscriptions Reset agent HealthService Cache size Verify the upgrade was successful Next Step See how to push agents Get familiar to other management packs (Ref: M$ SCOM Documents)","categories":[{"name":"Server","slug":"Server","permalink":"http://amblizer.xyz/categories/Server/"}],"tags":[{"name":"System Center","slug":"System-Center","permalink":"http://amblizer.xyz/tags/System-Center/"},{"name":"Operations Manager","slug":"Operations-Manager","permalink":"http://amblizer.xyz/tags/Operations-Manager/"},{"name":"SCOM","slug":"SCOM","permalink":"http://amblizer.xyz/tags/SCOM/"}]},{"title":"CS61A 2018 Pathway","slug":"CS61A","date":"2018-03-03T00:11:56.000Z","updated":"2018-10-29T08:19:25.574Z","comments":true,"path":"2018/03/02/CS61A/","link":"","permalink":"http://amblizer.xyz/2018/03/02/CS61A/","excerpt":"This is my learning path of CS 61A, you can check at my github repository for slides. ref: Structure and Interpretation of Computer Programs Spring 2018 Instructor: John DeNero","text":"This is my learning path of CS 61A, you can check at my github repository for slides. ref: Structure and Interpretation of Computer Programs Spring 2018 Instructor: John DeNero Pooling Chart Lecture Reading Note Handout Homework Functions 1.1, 1.2 Note 1 Lab 00: Introduction &amp; Workflow Names 1.3, 1.4 Note 2 Disc 00: Lost on the Moon HW 01 Pooling Chart suggested accompany 1-1 start 1-2 elements of programming 1-3 define functions 1-4 designing functions 1-5 control suggested accompany Data8 for data science, of fundamentals of computing, statistical inference, &amp; machine learning applied to real-world data setsmachine learning, with ore statistics than computer science. A great programming practice for CS 61A 1-1 start Priciples: beauty, simplicity and readability Definitions: Statements: codes usually describe actions Expressions: codes do computations Functions: a box of series of statements and/or expressions Objects: data and its unalienable properties Interpreters: to evaluate compound expressions in a predictable way functions are objects, objects are functions, and interpreters are instances of both. Expect errors: Debugging: know error itself and dignose it Priciples of debugging: Test incrementally, identify probles early and easily Isolate errors, localise according to output Check assumptions, make sure assumptions check with codes precisely Peer consulting, chart of valuable helpers Name|Specialize —|— Official Py Documentation|Everything The fundamental equation of computers is: computer = powerful + stupid Programming is about a person using their real insight to build something that the computer can do. — Francisco Cai and Nick Parlante, Stanford CS101 1-2 elements of programming Aims programming serves: instruction to a computer a framework of ideas, which is mor important Notice means to combine simple expresions and statement to complex combination and abstractions Expression: operators and operands with infix notation, eg. 1/2 + (1/4 + 1/8 + 1/16) + 1/32 + 1/64 + 1/128 with function notaton, eg. max(min(1, -2), min(pow(3, 5), -4)), and have THREE advantages over infix ones: arbitary number of arguments nested expressions in a straightforward way easy to type, no limit to kinds Definitions: ‘=’: assignment operator names: variable nams trees: grow from the top down Pure and non-pure functions Pure function have no side effects beyond return a value, call it for arbitary times with the same arguments must return same values. Non-pure function have side effects Advantages of pure over non-pure: more reliable to compose simpler to test essential for concurrent programs The Zen of Python by Tim Peters Beautiful is better than ugly.Explicit is better than implicit.Simple is better than complex.Complex is better than complicated.Flat is better than nested.Sparse is better than dense.Readability counts.Special cases aren’t special enough to break the rules.Although practicality beats purity.Errors should never pass silently.Unless explicitly silenced.In the face of ambiguity, refuse the temptation to guess.There should be one– and preferably only one –obvious way to &gt;do it.Although that way may not be obvious at first unless you’re &gt;Dutch.Now is better than never.Although never is often better than right now.If the implementation is hard to explain, it’s a bad idea.If the implementation is easy to explain, it may be a good &gt;idea.Namespaces are one honking great idea – let’s do more of those! 1-3 define functions A function have signature and body Singature have all variebles needed body indict expressions and statements Names of variebles remain local within function bodies Choosing names: essential to the interpretability, and usually follow simple rules: lowercase, words separated by underscores, good to be descriptive parameter names should be lowercase, in single word, and meaningful A helper function can be write at a a later time in the function Functional abstracion: Domain: Range: Intention: A programmer should not need to know how the function is implemented in order to use it 1-4 designing functions Functions are abstractions: Single job for each function, with a shortname and a short description Don’t repeat, abstract Generally defined, considering broader usage. Use docstring, triple quoted: First line: job of the function Following lines: argument and behavior Use help(function) to see the docstring Write docstrings for all functions necessary Code is written only once, but often read many times. Comments: attached following the # symbol, fr humans alone Values should be assigned defauts in most cases. 1-5 control Definitions Statement: to change thethe interpreter state Clause: a header and an indented suit of statemtns, and a suite is controlled by a header Compound Statement: consists of arbitary number of clauses Execution rule: excuted in order, end by redirection to control Modular Programs: where pure functions interact only via the values they take and return. To execute a sequence of statements, execute the first statement. If that statement does not redirect control, then proceed to execute the rest of the sequence of statements, if any remain. Local Assignment: bind a name to a value within the local frame Conditional statements: conditional statements, bool contexts, bool values Iteration Testing Assert statments: followed by a bool expression, and a text for FALSE, proceeded to next only when expectation is met. Doctests: seperate by a blank line from the description Unit Test: test that applies a single function, should be exhaustive. Key: test immediately after implementing","categories":[{"name":"Academic","slug":"Academic","permalink":"http://amblizer.xyz/categories/Academic/"}],"tags":[{"name":"python","slug":"python","permalink":"http://amblizer.xyz/tags/python/"}]},{"title":"SCU CSE 录取之后步骤 Post-admission Handbook","slug":"SCU-Memo","date":"2018-02-11T23:46:20.000Z","updated":"2018-10-29T08:03:53.036Z","comments":true,"path":"2018/02/11/SCU-Memo/","link":"","permalink":"http://amblizer.xyz/2018/02/11/SCU-Memo/","excerpt":"先贴上组织 | Groupchat for Santa Clara University SCU 2018 QQ Group: 699733238 SCU Global Telegram Group: https://t.me/SCUer SCU 2018 Wechat Group (If it expired let me know pls):","text":"先贴上组织 | Groupchat for Santa Clara University SCU 2018 QQ Group: 699733238 SCU Global Telegram Group: https://t.me/SCUer SCU 2018 Wechat Group (If it expired let me know pls): 申请 I-20 表 | I-20 Prerequisites2018年02月27日更新： 刚收到 SCU 邮件，要求等4月底 estimated expense 更新后再寄送材料。因为更新后需要的存款证明数额有可能发生变化，如果想现在开证明建议多开一些数额。 准备材料 | Paperworks: I-20 申请表 | I-20 request：点击下载 存款证明 | funding proof: 2017-2018年度：$46,209，具体形式点击查看详情 等待4月底更新 护照扫描件 | passport scan 然后将以上材料发送至 gradengineer@scu.edu，I-20的发放通常需要15个工作日审核，美国境外的申请者会通过 FedEx 或 DHL 寄送。 付费，填写 DS-160 表格 | Pay SEVIS, take DS-160 填写 I-901 表格，付SEVIS费，点击填写 填写 DS-160 表格，点击填写 付费，预约面签 | Pay and arrange interview 预约时间不能早于 I-20 上入学时间120天 | No prior to the commencement date on I-20. 最好用中信银行卡 | CITIC bank debit card is better (Chinese only) 准备好护照、DS-160、I-20，点击填写，费用160美元 | Take your passport, DS-160, I-20 面签 | Interview身份证明 | Proof of Identity 护照 passport I-20 SEVIS 收据 novice 预约面签付费确认 interview payment novice 个人简历 resume 学习证明 | Proof of Sduty 录取通知 | admission letter (print it out) TOEFL、GRE 成绩单 reports 学习计划 study plan Head of department CV (如果没有research advisor， Nam Ling) 财力证明 | Proof of Funding 存款证明（最近即可，无需冻结） proof of funding sponsor letter 银行流水？ Transactions (Necesssary?) 补充证明 | Additional Proof 在职证明、职业资格证书 professional cert / qualification 和父母的照片 family photo 结婚证 (Marriage License, if you have) 还有到场后会发的准入证 不能带入美使领馆 | Do not take 电子产品 electronic devices F-1、B-2 面签注意 | FAQs 英文打招呼，表明自己准备好语言能力 using English 保持自信 be confident 常见问题，可稍做准备，不要啰嗦 | frequent asking Why do you want to study in the U.S.? Which school are you going to? Why you choose this school? Who is paying for the study? What is your current job? And some follow-up detail questions about the job. What do you want to do after the study? Do you have any relative in U.S. ? Where are your parents and what do they do for a living? Do you have girlfriend/boyfriend? Are you married? Do you have children? How are you going to handle it if …(you decided to go for the study alone and be separated from the girlfriend/boyfriend, husband/wife/children, etc.) 赴美准备F-1 签证赴美时间可比I-20开学时间早至多30天 需随身携带： 护照原件 I-20原件 录取通知书 存款证明 随身药物对应的处方 少量现金 美标手机充电器 书面紧急联系人信息 书面出行计划 赴美当日过海关，准备： 存款证明 回答学校相关问题 地点 项目 就学期间住所 如何付学费 过关后： 确认取回护照和 I-20 原件 确认拿到I-94(Electronic Admission Record or I-94.) 出机场： SJC (San Jose Airport): 机场到学校有VTA免费班车，十几分钟 SFO (San Francisco International Airport): Bay Area Rapid Transit (BART) 和 Caltrain，90分钟 OAK (Oakland International Airport): 2.5小时","categories":[{"name":"Academic","slug":"Academic","permalink":"http://amblizer.xyz/categories/Academic/"}],"tags":[{"name":"Santa Clara University","slug":"Santa-Clara-University","permalink":"http://amblizer.xyz/tags/Santa-Clara-University/"},{"name":"SCU","slug":"SCU","permalink":"http://amblizer.xyz/tags/SCU/"}]},{"title":"千昌夫 - 北国の春","slug":"Northern-Spring","date":"2018-02-09T08:00:00.000Z","updated":"2018-10-29T08:40:33.137Z","comments":true,"path":"2018/02/09/Northern-Spring/","link":"","permalink":"http://amblizer.xyz/2018/02/09/Northern-Spring/","excerpt":"白樺（しら かば） 青空（あおぞら） 南風（みなみかぜ） こぶし咲（さく） あの丘（おか）北国（きたくに）の ああ 北国の春（はる）","text":"白樺（しら かば） 青空（あおぞら） 南風（みなみかぜ） こぶし咲（さく） あの丘（おか）北国（きたくに）の ああ 北国の春（はる） 季節（きせつ）が 都会（とかい）で はわからないだろと 届（とど）いた ふくろの 小（ちい）さな つつみ あの 故郷（ふるさと）へ 帰（かえ）ろかな 帰ろかな","categories":[{"name":"Music","slug":"Music","permalink":"http://amblizer.xyz/categories/Music/"}],"tags":[{"name":"Japanese","slug":"Japanese","permalink":"http://amblizer.xyz/tags/Japanese/"}]},{"title":"Django First Met","slug":"Django-First-Met","date":"2017-12-05T08:00:00.000Z","updated":"2018-10-29T08:46:09.583Z","comments":true,"path":"2017/12/05/Django-First-Met/","link":"","permalink":"http://amblizer.xyz/2017/12/05/Django-First-Met/","excerpt":"As demanded by my instructor, I need to grab the essence of Django in three weeks, which is not quite possible for a non-native CS candidate. Still, I struggled to follow the instructions given in the official document, and, well, not THAT official, that I’m actually doing a step by step tutorial in mandarin, which lags in the version of 1.10.5 instead of the newly announced 2.0. But this doesn’t trouble me at all since Anaconda also doesn’t provide the latest 2.0 update in the repertoire. So I just began.","text":"As demanded by my instructor, I need to grab the essence of Django in three weeks, which is not quite possible for a non-native CS candidate. Still, I struggled to follow the instructions given in the official document, and, well, not THAT official, that I’m actually doing a step by step tutorial in mandarin, which lags in the version of 1.10.5 instead of the newly announced 2.0. But this doesn’t trouble me at all since Anaconda also doesn’t provide the latest 2.0 update in the repertoire. So I just began. Implementing Virtual environmentI heard that functions in Django differ across various versions, and to save the trouble I implemented in virtual envs in Anaconda. Simply create a new env use: &gt;conda create -n Django1 Activate it: &gt;activate Django1 And install the proper version of Django: (django1) &gt;conda install Django=1.10.5 Create Django ProjectIn workspace directory, use: (django1) &gt;django-admin startproject blogproject Be sure to stay in the virtual env. Test the serverTo start the local server iIn blogproject directory use: (django1) &gt;python manage.py runserver Then visit localhost:8000 in a browser.","categories":[],"tags":[{"name":"python","slug":"python","permalink":"http://amblizer.xyz/tags/python/"},{"name":"django","slug":"django","permalink":"http://amblizer.xyz/tags/django/"}]},{"title":"テレサ．テン(邓丽君) - つぐない（偿还）","slug":"Repay","date":"2017-12-01T08:00:00.000Z","updated":"2018-10-29T08:40:06.802Z","comments":true,"path":"2017/12/01/Repay/","link":"","permalink":"http://amblizer.xyz/2017/12/01/Repay/","excerpt":"窓（まど）に西日（にしび）が あたる部屋（へや）は いつもあなたの 匂（にお）いがすろわ","text":"窓（まど）に西日（にしび）が あたる部屋（へや）は いつもあなたの 匂（にお）いがすろわ 一人（ひとり）暮（く）らせば 思（おも）い出（だ）すから 壁（かべ）の傷（きず）も 残（のこ）したまま おいてゆくわ 愛をつぐなえば 别(わか)れになるけど こんな女（おんな）でも 忘（わす）れないでね 優（やさ）しいすぎたのあなた 子供（こども）見（み）たいなあなた 明日（あす）は他人同士（たにんどうし）に なるけれど 心(こころ)残(のこ)りは あなたのこと 少(すこ)し烟草(たばこ)も ひかえめにして 过去(かこ)に缚(しば)られ 暮(く)らすことより わたしよりも可爱(かわい)い人 探(さが)すことよ 爱(あい)をつぐなえば 重荷(おもに)になるから この町(まち)を离(はな)れ 暮(く)らしてみるわ お酒(さけ)のむのも ひとり 梦(ゆめ)を见(み)るのも ひとり 明日（あす）は他人同士（たにんどうし なるけれど 爱(あい)をつぐなえば 别(わか)れになるけど こんな女(おんな)でも 忘(わす)れないでね 優(やさ)しいすぎたのあなた 子供(こども)见(み)たいなあなた 明日(あす)は他人同志(たにんどうし)に なるけれど","categories":[{"name":"Music","slug":"Music","permalink":"http://amblizer.xyz/categories/Music/"}],"tags":[{"name":"Japanese","slug":"Japanese","permalink":"http://amblizer.xyz/tags/Japanese/"}]},{"title":"中岛みゆき - 竹の歌","slug":"Bamboo-Song","date":"2017-11-02T07:00:00.000Z","updated":"2018-10-29T08:33:08.584Z","comments":true,"path":"2017/11/02/Bamboo-Song/","link":"","permalink":"http://amblizer.xyz/2017/11/02/Bamboo-Song/","excerpt":"Started to learn Japanese, hiragana seems a bit of troubling of its resembling of mandarin characters. Though being nervous these days, Jap songs, especially those from 80s and 90s, comfort me most, and it is an major cause for me to learn the language. So start with a rather easy one, the bamboo song by Miyuki Nakajima","text":"Started to learn Japanese, hiragana seems a bit of troubling of its resembling of mandarin characters. Though being nervous these days, Jap songs, especially those from 80s and 90s, comfort me most, and it is an major cause for me to learn the language. So start with a rather easy one, the bamboo song by Miyuki Nakajima 遥（はる）かな山（やま）から吹（ふ）きつける風（かぜ）に ひれ伏（ふ）しながら けして折（お）れはせぬ 押（お）し寄（よ）せる雲（くも）から打ちやまぬ雨（あめ）に ひれ伏（ふ）しながら けして折（お）れはせぬ 私（わたし）がなりたいものはといえば 地下（ちか）に根（ね）を張（は）る あの竹林（たけばやし） 月（つき）の日（ひ） 火（ひ）の日（ひ） 水（みず）の日（ひ） 木（き）の日（ひ） 金（がね）に踊（おど）って 土（つち）と日（ひ）に還（かえ）る 私（わたし）が住（す）みたい国（くに）はといえば 地下（ちか）に根（ね）を張（は）る あの竹（たけ）の国（くに） ゆく夏（なつ）来（く）る夏（なつ） 照（で）りつける熱（ねつ）に 埋（う）ずもれながら けして消（き）えはせぬ 青（あお）に黄（き）に緑（みどり）に 移（うつ）りゆく旗（はた）に 移（うつ）ろいながら けして消（き）えはせぬ 私（わたし）が覚（おぼ）えて残（のこ）せるものは 地下（ちか）に根（ね）を張（は）る あの竹（たけ）の歌（うた） 月（つき）の日（ひ） 火（ひ）の日（ひ） 水（みず）の日（ひ） 木（き）の日（ひ） 金（がね）に踊（おど）って 土（つち）と日（ひ）に還（かえ）る 私（わたし）が覚（おぼ）えて残（のこ）せるものは 地下（ちか）に根（ね）を張（は）る あの竹（たけ）の歌（うた） 月（つき）の日（ひ） 火（ひ）の日（ひ） 水（みず）の日（ひ） 木（き）の日（ひ） 金（がね）に踊（おど）って 土（つち）と日（ひ）に還（かえ）る 私（わたし）がなりたいものはといえば 地下（ちか）に根（ね）を張（は）る あの竹林（たけばやし）","categories":[{"name":"Music","slug":"Music","permalink":"http://amblizer.xyz/categories/Music/"}],"tags":[{"name":"Japanese","slug":"Japanese","permalink":"http://amblizer.xyz/tags/Japanese/"}]},{"title":"Saving loop 保存与循环","slug":"Saving-loop","date":"2017-06-10T07:00:00.000Z","updated":"2018-10-29T08:35:32.539Z","comments":true,"path":"2017/06/10/Saving-loop/","link":"","permalink":"http://amblizer.xyz/2017/06/10/Saving-loop/","excerpt":"#Saving loop 保存与循环 The loop ends only when successively saved","text":"#Saving loop 保存与循环 The loop ends only when successively saved 123456789while unsaved: try: wb.save(fn) unsaved = False except PermissionError: print(fn, 'in use, close and press enter to save again...') input() continue anything else？","categories":[{"name":"Algorithm","slug":"Algorithm","permalink":"http://amblizer.xyz/categories/Algorithm/"}],"tags":[{"name":"python","slug":"python","permalink":"http://amblizer.xyz/tags/python/"},{"name":"save","slug":"save","permalink":"http://amblizer.xyz/tags/save/"}]},{"title":"Install Cuda 8/CuDNN 6, Tensorflow and Keras on Windows 10","slug":"Win10-Cuda-TF","date":"2017-06-01T07:00:00.000Z","updated":"2018-10-29T08:46:53.974Z","comments":true,"path":"2017/06/01/Win10-Cuda-TF/","link":"","permalink":"http://amblizer.xyz/2017/06/01/Win10-Cuda-TF/","excerpt":"[Windows 10 安装 Cuda 8 + CuDNN 6, Tensorflow 和 keras，附CPU/GPU切换小技巧] Updated: Dec 29, 2017 Originally published on Amblizer.xyz, reblogged in case of blocking I’ve tried months ago to install the GPU-based Machine learning framework, namely keras with tensorflow, but get stuck following the official indication of the latter, and the issue remained unresolved until yesterday because of loads of patients in summer vocation, and I finally managed to get m1000m working.","text":"[Windows 10 安装 Cuda 8 + CuDNN 6, Tensorflow 和 keras，附CPU/GPU切换小技巧] Updated: Dec 29, 2017 Originally published on Amblizer.xyz, reblogged in case of blocking I’ve tried months ago to install the GPU-based Machine learning framework, namely keras with tensorflow, but get stuck following the official indication of the latter, and the issue remained unresolved until yesterday because of loads of patients in summer vocation, and I finally managed to get m1000m working. I basically followed instructions written in Chinese in http://blog.csdn.net/u012898521/article/details/69611800, with a few modifications according to keras documentation in Chinese HERE, and actually I did a combination of both. Step 1 - Python with AnacondaBy far tensorflow only support python 3 but no newer than major version of 3.5, and last time I got a lot of trouble tried to install the dependencies especially scipy. I didn’t use anaconda because it starts rather slow and Google said you could install tensorflow without it, and it was later I found scipy itself WILL encounter problems when installed on windows. Just download and intall Anaconda 5.0 with python 3, Simply install Anaconda with python 3.5 (I installed Anaconda 4.2.0 with python 3.5.2) 3.6, and it will save you all the troubles. Step 2 — CUDA and CuDNNNVIDIA had buried download links to older version of CUDA and CuDNN, so I list the links chart first. Package Compatible with Link CUDA 9.1 self-compiled Tensor Flow Click to download CUDA 8.0.61 &amp; prior TensorFlow Click to download CuDNN 6 TensorFlow Click to download CuDNN 5 &amp; prior Theano, etc Click to download CUDA is toolkit enables you to all the fun programming with NVIDIA GPU, you’re welcomed unless your GPU is prior to GTX 500 series. You’re encouraged to download CUDA 8.0.61 and CuDNN 6 in order to drive TensorFlow 1.4, and you’ll find it somewhat time consuming. Installation is simple a series of ‘Next’s. And now you can install CuDNN, an acceleration library for CUDA. You’ll require to signed a developer account in order to get it HERE, and then unzip the folders and overwrite folders at C:\\Program Files\\NVIDIA GPU Computing Toolkit\\CUDA\\8.0 with same names. Step 3 — Ananconda Environment &amp; TensorflowSimply use pip with installation. Create an Ananconda environment named “tf” using: &gt;conda create -n tf And activate the envirionmant by: &gt;activate tf Then the command shows: (tf) C:\\Users\\username&gt;_ which indicates that you have entered the newly create environment. By using the environment, we can capsule our manuvours within the very space, without influencing that global configuration of the whole system. This is especally useful when you’re testing different versions of same software packages, say, using python 3.5 &amp; 3.6 samultanously. To install CPU version(required): (tf) C:\\Users\\username&gt;conda install tensorflow Test the CPU version tensorflow: (tf) C:\\Users\\username&gt;python &gt;&gt;&gt;import tensorflow as tf To install GPU version(optional) (tf) C:\\Users\\username&gt;conda install tensorflow-gpu Restart first and then test the GPU version tensorflow: (tf) C:\\Users\\username&gt;python &gt;&gt;&gt;import tensorflow as tf Step 4 — KerasA line of code will do (tf) C:\\Users\\username&gt;conda install keras Keras will be installed with theano by default, but it will use tensorflow as the back-end, so don’t panic, and test if keras is installed correctly by (tf) C:\\Users\\username&gt;python &gt;&gt;&gt;import keras Now we could run the MNIST example in Keras with either CPU or GPU Step 5 — Run and switch between CPU and GPUDownload keras testing data sets HERE, or if you have git run 1git clone https://github.com/fchollet/keras.git Locate at keras/examples/, and run mnist_mlp.py, if you installed CUDA and CuDNN correctly, it will run on GPU by default, and here’s my running on GPU: Sadly I only have a M1000M on the laptop, of which the performance is compromised.","categories":[{"name":"Machine Learning","slug":"Machine-Learning","permalink":"http://amblizer.xyz/categories/Machine-Learning/"}],"tags":[{"name":"python","slug":"python","permalink":"http://amblizer.xyz/tags/python/"}]},{"title":"Alphabet in One Line","slug":"Alphabet","date":"2017-02-15T08:00:00.000Z","updated":"2018-10-29T08:43:36.038Z","comments":true,"path":"2017/02/15/Alphabet/","link":"","permalink":"http://amblizer.xyz/2017/02/15/Alphabet/","excerpt":"#List12&gt;&gt;&gt; [chr(i) for i in range(97,123)]['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']","text":"#List12&gt;&gt;&gt; [chr(i) for i in range(97,123)]['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z'] #String12&gt;&gt;&gt; ''.join([chr(i) for i in range(97,123)])'abcdefghijklmnopqrstuvwxyz' #two lines123&gt;&gt;&gt; import string&gt;&gt;&gt; string.ascii_lowercase'abcdefghijklmnopqrstuvwxyz' #dict两句话12&gt;&gt;&gt; dict.fromkeys(string.ascii_lowercase, 0)&#123;'a': 0, 'b': 0, 'c': 0, 'd': 0, 'e': 0, 'f': 0, 'g': 0, 'h': 0, 'i': 0, 'j': 0, 'k': 0, 'l': 0, 'm': 0, 'n': 0, 'o': 0, 'p': 0, 'q': 0, 'r': 0, 's': 0, 't': 0, 'u': 0, 'v': 0, 'w': 0, 'x': 0, 'y': 0, 'z': 0&#125; Fun isn’t it!","categories":[{"name":"Algorithm","slug":"Algorithm","permalink":"http://amblizer.xyz/categories/Algorithm/"}],"tags":[{"name":"python","slug":"python","permalink":"http://amblizer.xyz/tags/python/"},{"name":"alphabet","slug":"alphabet","permalink":"http://amblizer.xyz/tags/alphabet/"}]},{"title":"Fisher–Yates shuffle","slug":"Fisher–Yates","date":"2017-02-01T08:00:00.000Z","updated":"2018-10-29T08:41:41.934Z","comments":true,"path":"2017/02/01/Fisher–Yates/","link":"","permalink":"http://amblizer.xyz/2017/02/01/Fisher–Yates/","excerpt":"作为编程新手，又非本专业所学，在github上写博客似乎不自量力。然而记录本身也是学习的一部分，而这记录非此处不能写，那就开始吧。 在 w3cplus 看到洗牌算法似乎十分有趣，试着用python练习一下：","text":"作为编程新手，又非本专业所学，在github上写博客似乎不自量力。然而记录本身也是学习的一部分，而这记录非此处不能写，那就开始吧。 在 w3cplus 看到洗牌算法似乎十分有趣，试着用python练习一下： 12345678910111213141516171819def shuffle(s): import random ''' From last item to first item, change position with a random item before it. s: list of items ''' i = len(s) - 1 while i &gt; 0: ran = random.sample(range(i),1)[0] (s[ran],s[i]) = (s[i],s[ran]) i -= 1 return s&gt;&gt;&gt;shuffle(\"['1', '2', '3', '4', '5', '6', '7', '8', '9']\")['4', '7', '8', '6', '1', '2', '3', '9', '5']&gt;&gt;&gt;shuffle(\"['1', '2', '3', '4', '5', '6', '7', '8', '9']\")['8', '3', '1', '2', '9', '7', '4', '5', '6']&gt;&gt;&gt;shuffle(\"['1', '2', '3', '4', '5', '6', '7', '8', '9']\")['9', '7', '1', '3', '2', '8', '4', '5', '6'] 还是挺好玩的嘛！","categories":[{"name":"Algorithm","slug":"Algorithm","permalink":"http://amblizer.xyz/categories/Algorithm/"}],"tags":[{"name":"Fisher–Yates shuffle","slug":"Fisher–Yates-shuffle","permalink":"http://amblizer.xyz/tags/Fisher–Yates-shuffle/"},{"name":"algorithm","slug":"algorithm","permalink":"http://amblizer.xyz/tags/algorithm/"},{"name":"python","slug":"python","permalink":"http://amblizer.xyz/tags/python/"}]},{"title":"Win 10 廉价指纹方案：EgisTec ES603","slug":"Win10-Fingerprint","date":"2016-03-16T20:13:43.000Z","updated":"2018-10-29T16:34:05.257Z","comments":true,"path":"2016/03/16/Win10-Fingerprint/","link":"","permalink":"http://amblizer.xyz/2016/03/16/Win10-Fingerprint/","excerpt":"​​最近突然有给电脑配指纹验证的想法，经过一番折腾，最后百元之内完美启用Wind 10 hello的指纹登陆。 硬件：EgisTec ES603，淘宝搜索即可，70元左右","text":"​​最近突然有给电脑配指纹验证的想法，经过一番折腾，最后百元之内完美启用Wind 10 hello的指纹登陆。 硬件：EgisTec ES603，淘宝搜索即可，70元左右 驱动：这一步是关键，随机附带的驱动为非WBF（Windows Biometric Framework）版本，只能通过第三方软件配合使用。一番搜索后发现此模块和TravelMate P446-M的指纹模块驱动一致，恰巧Acer在官网发布了其支持Win 10 x64的WBF版本驱动，下载安装后重启即可。进入登陆选项，设置Pin之后即可使用，如下图： 点击下载驱动 嗯，的确是物美价廉。​​​​","categories":[{"name":"Miscellaneous","slug":"Miscellaneous","permalink":"http://amblizer.xyz/categories/Miscellaneous/"}],"tags":[{"name":"Fingerprint","slug":"Fingerprint","permalink":"http://amblizer.xyz/tags/Fingerprint/"},{"name":"Windows 10","slug":"Windows-10","permalink":"http://amblizer.xyz/tags/Windows-10/"}]}]}